//RF9FA3      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL ??? FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A3R        EXEC PGM=A3SCOMM
//STEPLIB      DD DSN=KC03F9F.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR
//INFILE       DD DSN=KC03F9F.DCMAFD01.A3.SCOMM.DATA,
//    DISP=SHR
//OUTFILE      DD DSN=KC03F9F.DCMAFD01.A3.SCOMM.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=96
/*