//RF9FA1         JOB
/*
//A1STARTR    EXEC PGM=A1START
//STEPLIB      DD DSN=KC03F9F.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR
//OUTFILE      DD DSN=KC03F9F.DCMAFD01.A1.REPORT.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=80
/*